<template>
    <h1 class="hide">Artfood - магазин кондитеских товаров</h1>
    <div class="container">
        <MainPromo v-if="discounts" class="promo"
            :discounts="discounts?.results" />

    </div>
    <MainDiscountProducts class="discount" />
    <MainPopularProducts class="popular" />
    <TextLine />
    <MainNewProducts />
    <div class="container">
        <MainPromo v-if="discounts" class="slider"
            :discounts="discounts?.results" />
        <MainPartners class="brands" />
    </div>
    <div class="bg-grey">
        <MainPopularCategories class="categories" />
        <MainAdvantages />
        <div class="container">
            <MainAbout />
        </div>
    </div>
    <MainBlogBlock class="blog-block" />
</template>
<script lang="ts" setup>
import { useFavoriteStore } from '~/store/favorite';
import type { ListDiscount } from '~/types/api-schema';

const { data: discounts } = useFetch<ListDiscount[]>('/api/discounts-is_show')

useHead({
    title: 'Artfood - интернет магазин кондитерских товаров',
    meta: [
        { name: 'keywords', content: 'Artfood, артфуд, Все для кондитера, Все для ресторана, Хорека, Шоколад оптом, Сливки оптом, Маргарин оптом, Арахис оптом, Сухое молоко оптом, Сахарная пудра оптом, -Шоколад Калебаут, -шоколад Callebaut, -мастер мартини, -пуратос, -конфитюры, -начинки термостабильные, -сливки натуральные, -крем для взбивания, -глазурь шоколадная, -крем чиз, -сыр сливочный, -творожный крем, -творог, -Молоко сгущенное, -молоко варёное, -сгущенка, -какао порошок, -какао алкализованное, -инвентарь для кондитера, -пасты шоколадные, -заварной крем, -сахарная пудра, -Посыпки для торта, -Посыпки для мороженого, -смесь для мороженого, -Топпинги фруктовые, -повидло яблочное, -подварка клубничная, -заварной крем, -сахарная пудра, -помадка сахарная, -сухофрукты, -специи, -орехи, -миндальная мука, -фисташковая мука, Рисовая мука, Сухое молоко обезжиренное, Сухое молоко 26%, Сметана, Стабилизаторы для сливок, Пергаментная бумага, Силиконовые формы, Силиконизированная бумага для выпечки, Консервированная вишня с веточкой, Консервированная черешня, Консервированные ананасы кольца, Ананасы кусочки, Персик консервированный, Кукурузный крахмал, Картофельный крахмал, Мак пищевой, Кунжут белый, Кунжут чёрный, Корица молотая, Специи, Изюм, Курага, Грецкий орех, Фундук, Арахис дроблённый, Арахис лепестки, Арахис бланшированный, Фисташки очищенные, Миндальные лепестки, Мастика для торта, Мармелад фигурный, Переводные листы на шоколад, Красители пищевые, Аллюра, Понсо, Маргарин для песочного теста, Маргарин для слоенного теста, Фритюрный жир, Сиропы фруктово-ягодные, Закваска для хлеба, Хлебные смеси, Улучшители для муки, Разрыхлители теста, Глицерин пищевой, Агар-агар, Ажурные салфетки под торт, Альбумин, Сухой яичный порошок, Ванилин, Глюкозный сироп, Инвертный сироп, Диоксид титана, Дрожжи сырые, Дрожжи сухие, Желатин листовой, Желатин халяль, Желатин порошок, Каби, Изомальт, Кокосовая стружка медиум, Кокосовая стружка файн, Кандурины, Пектин яблочный, Пектин NH, Пектин цитрусовый, Лимонная кислота, Лук жареный, Ленты бордюрные для торта, Ленты бордюрные прозрачные, Ленты бордюрные с рисунком, Ацетатная плёнка, Плёнка пищевая, Миндальное молоко, Паста фисташковая, Паста фундучная, Шокомилк, Шокодель, Каравелла, Нутелла, Подложка золотая для торта, Коррексы для тортов, Тара для торта, Коробки под торт, Вафельная бумага, Сахарная бумага для пищевой печати, Пищевая печать, Пюре манго-маракуйя, Пюре фруктовое, Пюре ягодное, Рис воздушный в карамели, Дутый рис, Савоярди печенье, Пекарский порошок, Нетающая сахарная пудра, Смесь Чиабатта, Смесь для маффин, Эмульгатор для взбивания, Гель ваниль, Гель карамель, Желе холодное, Желе горячее, Сублимированная клубника, Сублимированная малина, Сухие сливки, Тыквенные семечки, Кукуруза сладкая, Кукинг, Кукуруза консервированная, Огурцы кон', },
        {
            name: 'description',
            content: 'ArtFood - ваш надежный партнер в мире кондитерского сырья. Мы предлагаем широкий ассортимент продукции самого высокого качества. Наша специализация - поставка и продажа кондитерских ингредиентов для профессиональных кондитеров, как местного, так и импортного производства. предприятий общественного питания и любителей сладкого творчества. Наше портфолио включает в себя широкий выбор продуктов, от высококлассных ингредиентов до инновационных решений для творчества в кондитерском искусстве.'
        }
    ]

})
</script>
<style lang="scss" scoped>
.hide {
    display: none;
}

.promo {
    margin-top: 40px;

    @include atMd {
        margin-top: 16px;
    }
}

.blog-block {
    padding-bottom: 100px;

    @include atMd {
        padding-bottom: 60px;
    }
}

.popular,
.discount {
    margin-top: 120px;

    @include atMd {
        margin-top: 80px;
    }
}


.slider {
    margin-top: 120px;
    padding-bottom: 120px;

    @include atMd {
        padding-bottom: 80px;
        margin-top: 100px;
    }
}

.brands {
    padding-top: 120px;
    margin-top: 120px;

    @include atMd {
        padding-top: 70px;
        margin-top: 70px;
    }
}

.bg-grey {
    background-color: #F9F9F9;
    padding-top: 120px;
    margin-top: 120px;

    @include atMd {
        padding-top: 70px;
        margin-top: 70px;
    }
}
</style>